[
  {
    "id": 1,
    "text": "Menuntut ilmu itu wajib atas setiap muslim.",
    "arabic": "طَلَبُ الْعِلْمِ فَرِيضَةٌ عَلَى كُلِّ مُسْلِمٍ",
    "source": "HR. Ibnu Majah No. 224",
    "status": "Shahih",
    "category": "Kewajiban Menuntut Ilmu",
    "explanation": "Hadits ini menegaskan bahwa menuntut ilmu adalah kewajiban individual bagi setiap muslim, baik laki-laki maupun perempuan."
  },
  {
    "id": 2,
    "text": "Barangsiapa menempuh jalan untuk mencari ilmu, maka Allah akan memudahkan baginya jalan ke surga.",
    "arabic": "مَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ",
    "source": "HR. Muslim No. 2699",
    "status": "Shahih",
    "category": "Keutamaan Menuntut Ilmu",
    "explanation": "Allah menjanjikan kemudahan jalan ke surga bagi mereka yang bersungguh-sungguh mencari ilmu."
  },
  {
    "id": 3,
    "text": "Barangsiapa yang Allah kehendaki kebaikan padanya, maka Allah akan memahamkannya dalam urusan agama.",
    "arabic": "مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ",
    "source": "HR. Bukhari No. 71, Muslim No. 1037",
    "status": "Shahih - Muttafaq 'Alaih",
    "category": "Tanda Kebaikan",
    "explanation": "Pemahaman mendalam tentang agama adalah tanda bahwa Allah menghendaki kebaikan pada seseorang."
  },
  {
    "id": 4,
    "text": "Sesungguhnya para ulama adalah pewaris para nabi. Para nabi tidak mewariskan dinar atau dirham, namun mereka mewariskan ilmu. Barangsiapa mengambilnya, maka ia telah mengambil bagian yang sempurna.",
    "arabic": "إِنَّ الْعُلَمَاءَ وَرَثَةُ الْأَنْبِيَاءِ، إِنَّ الْأَنْبِيَاءَ لَمْ يُوَرِّثُوا دِينَارًا وَلَا دِرْهَمًا، إِنَّمَا وَرَّثُوا الْعِلْمَ، فَمَنْ أَخَذَهُ أَخَذَ بِحَظٍّ وَافِرٍ",
    "source": "HR. Abu Dawud No. 3641, Tirmidzi No. 2682",
    "status": "Shahih",
    "category": "Kedudukan Ulama",
    "explanation": "Ilmu adalah warisan terbesar dari para nabi, lebih berharga dari harta benda."
  },
  {
    "id": 5,
    "text": "Barangsiapa keluar untuk mencari ilmu, maka ia berada di jalan Allah hingga ia kembali.",
    "arabic": "مَنْ خَرَجَ فِي طَلَبِ الْعِلْمِ فَهُوَ فِي سَبِيلِ اللَّهِ حَتَّى يَرْجِعَ",
    "source": "HR. Tirmidzi No. 2647",
    "status": "Shahih",
    "category": "Jihad Ilmu",
    "explanation": "Mencari ilmu dianggap sebagai jihad fi sabilillah, ibadah yang sangat mulia."
  },
  {
    "id": 6,
    "text": "Tidaklah suatu kaum duduk di salah satu rumah Allah (masjid) membaca Kitab Allah dan saling mempelajarinya, melainkan ketenangan akan turun kepada mereka, rahmat meliputi mereka, para malaikat mengelilingi mereka, dan Allah menyebut-nyebut mereka di hadapan makhluk yang ada di sisi-Nya.",
    "arabic": "مَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ إِلَّا نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ وَغَشِيَتْهُمُ الرَّحْمَةُ وَحَفَّتْهُمُ الْمَلَائِكَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ",
    "source": "HR. Muslim No. 2699",
    "status": "Shahih",
    "category": "Majelis Ilmu",
    "explanation": "Berkumpul untuk belajar Al-Qur'an mendatangkan rahmat dan keberkahan dari Allah."
  },
  {
    "id": 7,
    "text": "Sebaik-baik kalian adalah orang yang mempelajari Al-Qur'an dan mengajarkannya.",
    "arabic": "خَيْرُكُمْ مَنْ تَعَلَّمَ الْقُرْآنَ وَعَلَّمَهُ",
    "source": "HR. Bukhari No. 5027",
    "status": "Shahih",
    "category": "Pembelajaran Al-Qur'an",
    "explanation": "Mempelajari dan mengajarkan Al-Qur'an adalah amalan terbaik dalam Islam."
  },
  {
    "id": 8,
    "text": "Keutamaan orang yang berilmu atas orang yang beribadah seperti keutamaan bulan purnama atas seluruh bintang.",
    "arabic": "فَضْلُ الْعَالِمِ عَلَى الْعَابِدِ كَفَضْلِ الْقَمَرِ لَيْلَةَ الْبَدْرِ عَلَى سَائِرِ الْكَوَاكِبِ",
    "source": "HR. Abu Dawud No. 3641, Tirmidzi No. 2682",
    "status": "Shahih",
    "category": "Keutamaan Ilmu",
    "explanation": "Orang berilmu memiliki kedudukan yang sangat tinggi, bahkan melebihi ahli ibadah."
  },
  {
    "id": 9,
    "text": "Sesungguhnya Allah, para malaikat-Nya, penghuni langit dan bumi, hingga semut di dalam lubangnya dan ikan, semuanya bershalawat kepada orang yang mengajarkan kebaikan kepada manusia.",
    "arabic": "إِنَّ اللَّهَ وَمَلَائِكَتَهُ وَأَهْلَ السَّمَوَاتِ وَالْأَرَضِينَ حَتَّى النَّمْلَةَ فِي جُحْرِهَا وَحَتَّى الْحُوتَ لَيُصَلُّونَ عَلَى مُعَلِّمِ النَّاسِ الْخَيْرَ",
    "source": "HR. Tirmidzi No. 2685",
    "status": "Shahih",
    "category": "Keutamaan Mengajar",
    "explanation": "Seluruh makhluk mendoakan orang yang mengajarkan kebaikan."
  },
  {
    "id": 10,
    "text": "Barangsiapa ditanya tentang suatu ilmu lalu ia menyembunyikannya, maka ia akan dikekang dengan kekangan dari api neraka pada hari kiamat.",
    "arabic": "مَنْ سُئِلَ عَنْ عِلْمٍ فَكَتَمَهُ أُلْجِمَ يَوْمَ الْقِيَامَةِ بِلِجَامٍ مِنْ نَارٍ",
    "source": "HR. Abu Dawud No. 3658, Tirmidzi No. 2649",
    "status": "Shahih",
    "category": "Larangan Menyembunyikan Ilmu",
    "explanation": "Menyembunyikan ilmu yang bermanfaat adalah dosa besar yang diancam dengan siksa neraka."
  },
  {
    "id": 11,
    "text": "Ilmu itu diperoleh dengan belajar, dan kesabaran itu diperoleh dengan melatih kesabaran.",
    "arabic": "إِنَّمَا الْعِلْمُ بِالتَّعَلُّمِ، وَإِنَّمَا الْحِلْمُ بِالتَّحَلُّمِ",
    "source": "HR. Bukhari dalam Al-Adab Al-Mufrad No. 594",
    "status": "Shahih",
    "category": "Proses Belajar",
    "explanation": "Ilmu dan karakter sabar keduanya memerlukan proses pembelajaran dan latihan."
  },
  {
    "id": 12,
    "text": "Mudahkanlah dan jangan mempersulit, gembirakanlah dan jangan membuat orang lari.",
    "arabic": "يَسِّرُوا وَلَا تُعَسِّرُوا، وَبَشِّرُوا وَلَا تُنَفِّرُوا",
    "source": "HR. Bukhari No. 69, Muslim No. 1734",
    "status": "Shahih - Muttafaq 'Alaih",
    "category": "Metode Mengajar",
    "explanation": "Prinsip dasar dalam mengajar adalah kemudahan dan memberi kabar gembira."
  },
  {
    "id": 13,
    "text": "Sesungguhnya Allah tidak mencabut ilmu dengan mencabutnya langsung dari hamba-hamba-Nya, tetapi Dia mencabut ilmu dengan mewafatkan para ulama.",
    "arabic": "إِنَّ اللَّهَ لَا يَقْبِضُ الْعِلْمَ انْتِزَاعًا يَنْتَزِعُهُ مِنَ الْعِبَادِ، وَلَكِنْ يَقْبِضُ الْعِلْمَ بِقَبْضِ الْعُلَمَاءِ",
    "source": "HR. Bukhari No. 100, Muslim No. 2673",
    "status": "Shahih - Muttafaq 'Alaih",
    "category": "Pentingnya Ulama",
    "explanation": "Ilmu hilang dengan wafatnya para ulama, menunjukkan pentingnya regenerasi."
  },
  {
    "id": 14,
    "text": "Barangsiapa mempelajari ilmu yang seharusnya dicari untuk mengharap ridha Allah, tetapi ia tidak mempelajarinya kecuali untuk mendapatkan keuntungan dunia, maka ia tidak akan mencium bau surga pada hari kiamat.",
    "arabic": "مَنْ تَعَلَّمَ عِلْمًا مِمَّا يُبْتَغَى بِهِ وَجْهُ اللَّهِ لَا يَتَعَلَّمُهُ إِلَّا لِيُصِيبَ بِهِ عَرَضًا مِنَ الدُّنْيَا لَمْ يَجِدْ عَرْفَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ",
    "source": "HR. Abu Dawud No. 3664",
    "status": "Shahih",
    "category": "Niat dalam Menuntut Ilmu",
    "explanation": "Keikhlasan niat sangat penting dalam menuntut ilmu."
  },
  {
    "id": 15,
    "text": "Orang mukmin yang kuat lebih baik dan lebih dicintai Allah daripada mukmin yang lemah, dan pada masing-masing ada kebaikan.",
    "arabic": "الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ وَفِي كُلٍّ خَيْرٌ",
    "source": "HR. Muslim No. 2664",
    "status": "Shahih",
    "category": "Kekuatan Iman dan Ilmu",
    "explanation": "Kekuatan mencakup aspek iman, ilmu, fisik, dan mental."
  },
  {
    "id": 16,
    "text": "Dua sifat yang tidak akan pernah berkumpul pada seorang munafik: akhlak yang baik dan pemahaman dalam agama.",
    "arabic": "خَصْلَتَانِ لَا تَجْتَمِعَانِ فِي مُنَافِقٍ: حُسْنُ سَمْتٍ وَلَا فِقْهٌ فِي الدِّينِ",
    "source": "HR. Tirmidzi No. 2684",
    "status": "Shahih",
    "category": "Tanda Keimanan",
    "explanation": "Pemahaman agama yang benar adalah tanda keimanan sejati."
  },
  {
    "id": 17,
    "text": "Barangsiapa mengamalkan apa yang ia ketahui, maka Allah akan mewariskan kepadanya ilmu yang belum ia ketahui.",
    "arabic": "مَنْ عَمِلَ بِمَا عَلِمَ وَرَّثَهُ اللَّهُ عِلْمَ مَا لَمْ يَعْلَمْ",
    "source": "HR. Abu Nu'aim dalam Hilyah Al-Auliya",
    "status": "Hasan",
    "category": "Ilmu dan Amal",
    "explanation": "Mengamalkan ilmu adalah kunci untuk mendapat ilmu lebih banyak."
  },
  {
    "id": 18,
    "text": "Tidak termasuk golongan kami orang yang tidak menyayangi anak kecil kami dan tidak menghormati orang tua kami, serta tidak mengetahui hak ulama kami.",
    "arabic": "لَيْسَ مِنَّا مَنْ لَمْ يَرْحَمْ صَغِيرَنَا وَيُوَقِّرْ كَبِيرَنَا وَيَعْرِفْ لِعَالِمِنَا حَقَّهُ",
    "source": "HR. Ahmad No. 22807",
    "status": "Shahih",
    "category": "Adab kepada Ulama",
    "explanation": "Menghormati ulama adalah bagian dari akhlak Islam."
  },
  {
    "id": 19,
    "text": "Carilah ilmu dan ajarkanlah kepada manusia, pelajarilah ketenangan dan kehormatan, dan rendah hatilah kepada orang yang kalian belajar darinya dan kepada orang yang kalian ajarkan.",
    "arabic": "تَعَلَّمُوا الْعِلْمَ وَعَلِّمُوهُ النَّاسَ، وَتَعَلَّمُوا الْوَقَارَ وَالسَّكِينَةَ، وَتَوَاضَعُوا لِمَنْ تَعَلَّمْتُمْ مِنْهُ وَلِمَنْ عَلَّمْتُمُوهُ",
    "source": "HR. Thabrani dalam Al-Ausath",
    "status": "Hasan",
    "category": "Adab Ilmu",
    "explanation": "Kerendahan hati adalah syarat dalam menuntut dan mengajarkan ilmu."
  },
  {
    "id": 20,
    "text": "Rasulullah tidak pernah berbicara dengan cepat seperti kalian berbicara dengan cepat, tetapi beliau berbicara dengan pembicaraan yang jelas, terpisah-pisah, sehingga orang yang duduk bersamanya dapat menghafalnya.",
    "arabic": "لَمْ يَكُنْ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَسْرُدُ الْحَدِيثَ كَسَرْدِكُمْ، وَلَكِنَّهُ كَانَ يَتَكَلَّمُ بِكَلَامٍ بَيْنَهُ فَصْلٌ، يَحْفَظُهُ مَنْ جَلَسَ إِلَيْهِ",
    "source": "HR. Tirmidzi No. 3639",
    "status": "Shahih",
    "category": "Metode Mengajar Nabi",
    "explanation": "Nabi mengajar dengan jelas dan perlahan agar mudah dipahami."
  },
  {
    "id": 21,
    "text": "Perintahkanlah anak-anak kalian untuk shalat ketika mereka berusia tujuh tahun, dan pukullah mereka (jika meninggalkan shalat) ketika berusia sepuluh tahun, dan pisahkanlah tempat tidur mereka.",
    "arabic": "مُرُوا أَوْلَادَكُمْ بِالصَّلَاةِ وَهُمْ أَبْنَاءُ سَبْعِ سِنِينَ، وَاضْرِبُوهُمْ عَلَيْهَا وَهُمْ أَبْنَاءُ عَشْرٍ، وَفَرِّقُوا بَيْنَهُمْ فِي الْمَضَاجِعِ",
    "source": "HR. Abu Dawud No. 495",
    "status": "Shahih",
    "category": "Pendidikan Anak",
    "explanation": "Pendidikan ibadah dimulai sejak usia 7 tahun dengan metode bertahap."
  },
  {
    "id": 22,
    "text": "Tidak ada pemberian seorang ayah kepada anaknya yang lebih utama daripada adab yang baik.",
    "arabic": "مَا نَحَلَ وَالِدٌ وَلَدًا مِنْ نَحْلٍ أَفْضَلَ مِنْ أَدَبٍ حَسَنٍ",
    "source": "HR. Tirmidzi No. 1952",
    "status": "Hasan Shahih",
    "category": "Pendidikan Karakter",
    "explanation": "Pendidikan adab adalah warisan terbaik orangtua kepada anak."
  },
  {
    "id": 23,
    "text": "Muliakanlah anak-anak kalian dan baguskanlah adab mereka.",
    "arabic": "أَكْرِمُوا أَوْلَادَكُمْ وَأَحْسِنُوا أَدَبَهُمْ",
    "source": "HR. Ibnu Majah No. 3671",
    "status": "Hasan",
    "category": "Pendidikan Anak",
    "explanation": "Memuliakan anak dengan pendidikan adab yang baik."
  },
  {
    "id": 24,
    "text": "Setiap kalian adalah pemimpin dan setiap kalian akan dimintai pertanggungjawaban atas kepemimpinannya. Seorang laki-laki adalah pemimpin dalam keluarganya dan akan dimintai pertanggungjawaban atas kepemimpinannya.",
    "arabic": "كُلُّكُمْ رَاعٍ وَكُلُّكُمْ مَسْؤُولٌ عَنْ رَعِيَّتِهِ، الرَّجُلُ رَاعٍ فِي أَهْلِهِ وَهُوَ مَسْؤُولٌ عَنْ رَعِيَّتِهِ",
    "source": "HR. Bukhari No. 893, Muslim No. 1829",
    "status": "Shahih - Muttafaq 'Alaih",
    "category": "Tanggung Jawab Pendidikan",
    "explanation": "Pendidikan keluarga adalah tanggung jawab yang akan dimintai pertanggungjawaban."
  },
  {
    "id": 25,
    "text": "Ajarilah anak-anak kalian berkuda, berenang, dan memanah.",
    "arabic": "عَلِّمُوا أَبْنَاءَكُمُ الرِّمَايَةَ وَالسِّبَاحَةَ وَرُكُوبَ الْخَيْلِ",
    "source": "HR. Baihaqi, diperkuat Umar bin Khattab",
    "status": "Hasan",
    "category": "Pendidikan Fisik",
    "explanation": "Pendidikan fisik dan keterampilan praktis penting untuk anak."
  },
  {
    "id": 26,
    "text": "Hak anak atas ayahnya adalah memberinya nama yang baik, mendidiknya dengan baik, dan mengajarkannya Al-Qur'an.",
    "arabic": "حَقُّ الْوَلَدِ عَلَى الْوَالِدِ أَنْ يُحْسِنَ اسْمَهُ وَيُحْسِنَ أَدَبَهُ وَيُعَلِّمَهُ الْقُرْآنَ",
    "source": "HR. Baihaqi No. 8862",
    "status": "Hasan",
    "category": "Hak Anak",
    "explanation": "Tiga hak dasar anak: nama baik, pendidikan adab, dan pengajaran Al-Qur'an."
  },
  {
    "id": 27,
    "text": "Cukuplah seseorang dikatakan berdosa bila ia menyia-nyiakan orang yang menjadi tanggungannya.",
    "arabic": "كَفَى بِالْمَرْءِ إِثْمًا أَنْ يُضَيِّعَ مَنْ يَقُوتُ",
    "source": "HR. Abu Dawud No. 1692",
    "status": "Shahih",
    "category": "Tanggung Jawab Keluarga",
    "explanation": "Mengabaikan pendidikan keluarga adalah dosa besar."
  },
  {
    "id": 28,
    "text": "Barangsiapa memiliki tiga anak perempuan atau tiga saudara perempuan, atau dua anak perempuan atau dua saudara perempuan, lalu ia berbuat baik dalam mendidik mereka dan bertakwa kepada Allah, maka baginya surga.",
    "arabic": "مَنْ كَانَ لَهُ ثَلَاثُ بَنَاتٍ أَوْ ثَلَاثُ أَخَوَاتٍ أَوْ بِنْتَانِ أَوْ أُخْتَانِ فَأَحْسَنَ صُحْبَتَهُنَّ وَاتَّقَى اللَّهَ فِيهِنَّ فَلَهُ الْجَنَّةُ",
    "source": "HR. Tirmidzi No. 1916",
    "status": "Shahih",
    "category": "Pendidikan Anak Perempuan",
    "explanation": "Mendidik anak perempuan dengan baik adalah jalan ke surga."
  },
  {
    "id": 29,
    "text": "Ajarkanlah kebaikan kepada orang lain, niscaya kalian akan menjadi orang yang paling berilmu di antara manusia.",
    "arabic": "عَلِّمُوا غَيْرَكُمُ الْخَيْرَ تَكُونُوا أَعْلَمَ النَّاسِ",
    "source": "HR. Darimi No. 242",
    "status": "Hasan",
    "category": "Manfaat Mengajar",
    "explanation": "Mengajar orang lain memperdalam ilmu kita sendiri."
  },
  {
    "id": 30,
    "text": "Allah berfirman: Wahai anak Adam, luangkanlah waktumu untuk beribadah kepada-Ku, niscaya Aku akan memenuhi hatimu dengan kekayaan dan menutupi kefakiranmu.",
    "arabic": "يَا ابْنَ آدَمَ تَفَرَّغْ لِعِبَادَتِي أَمْلَأْ صَدْرَكَ غِنًى وَأَسُدَّ فَقْرَكَ",
    "source": "HR. Tirmidzi No. 2466",
    "status": "Shahih",
    "category": "Prioritas Ibadah",
    "explanation": "Mendahulukan ibadah dan ilmu akan membawa keberkahan."
  },
  {
    "id": 31,
    "text": "Perumpamaan orang yang mengajarkan kebaikan kepada manusia tetapi melupakan dirinya sendiri adalah seperti sumbu yang menerangi manusia tetapi membakar dirinya sendiri.",
    "arabic": "مَثَلُ الَّذِي يُعَلِّمُ النَّاسَ الْخَيْرَ وَيَنْسَى نَفْسَهُ كَمَثَلِ الْفَتِيلَةِ تُضِيءُ عَلَى النَّاسِ وَتَحْرِقُ نَفْسَهَا",
    "source": "HR. Thabrani dalam Al-Kabir",
    "status": "Hasan",
    "category": "Amal Ilmu",
    "explanation": "Pentingnya mengamalkan ilmu yang diajarkan."
  },
  {
    "id": 32,
    "text": "Barangsiapa Allah gunakan untuk memberikan kebaikan, maka Allah akan menjadikannya seorang faqih (ahli agama).",
    "arabic": "مَنْ يُرِدِ اللَّهُ أَنْ يَنْفَعَ بِهِ جَعَلَهُ فَقِيهًا",
    "source": "HR. Thabrani",
    "status": "Shahih",
    "category": "Manfaat Ilmu",
    "explanation": "Allah menjadikan seseorang berilmu untuk memberi manfaat kepada umat."
  },
  {
    "id": 33,
    "text": "Sesungguhnya Allah tidak melihat kepada bentuk tubuh kalian dan tidak pula kepada harta kalian, tetapi Dia melihat kepada hati dan amal perbuatan kalian.",
    "arabic": "إِنَّ اللَّهَ لَا يَنْظُرُ إِلَى صُوَرِكُمْ وَأَمْوَالِكُمْ وَلَكِنْ يَنْظُرُ إِلَى قُلُوبِكُمْ وَأَعْمَالِكُمْ",
    "source": "HR. Muslim No. 2564",
    "status": "Shahih",
    "category": "Hakikat Nilai",
    "explanation": "Yang dinilai Allah adalah hati dan amal, bukan penampilan fisik."
  },
  {
    "id": 34,
    "text": "Barangsiapa meniti suatu jalan untuk mendapatkan ilmu, niscaya Allah akan memudahkan baginya jalan ke surga.",
    "arabic": "مَنْ سَلَكَ طَرِيقًا يَبْتَغِي فِيهِ عِلْمًا سَلَكَ اللَّهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ",
    "source": "HR. Ibnu Majah No. 225",
    "status": "Shahih",
    "category": "Jalan ke Surga",
    "explanation": "Setiap langkah mencari ilmu adalah langkah menuju surga."
  },
  {
    "id": 35,
    "text": "Sesungguhnya malaikat meletakkan sayapnya untuk penuntut ilmu karena ridha dengan apa yang ia cari.",
    "arabic": "إِنَّ الْمَلَائِكَةَ لَتَضَعُ أَجْنِحَتَهَا لِطَالِبِ الْعِلْمِ رِضًا بِمَا يَطْلُبُ",
    "source": "HR. Ibnu Majah No. 226",
    "status": "Shahih",
    "category": "Kemuliaan Penuntut Ilmu",
    "explanation": "Para malaikat menghormati dan meridhai penuntut ilmu."
  },
  {
    "id": 36,
    "text": "Barangsiapa yang mempelajari satu bab dari ilmu untuk mengajarkannya kepada manusia, maka ia diberi pahala tujuh puluh orang siddiq.",
    "arabic": "مَنْ تَعَلَّمَ بَابًا مِنَ الْعِلْمِ لِيُعَلِّمَهُ النَّاسَ أُعْطِيَ ثَوَابَ سَبْعِينَ صِدِّيقًا",
    "source": "HR. Ibnu Majah",
    "status": "Hasan",
    "category": "Pahala Mengajar",
    "explanation": "Mengajarkan ilmu mendapat pahala berlipat ganda."
  },
  {
    "id": 37,
    "text": "Dunia itu terlaknat, terlaknat pula apa yang ada di dalamnya, kecuali dzikir kepada Allah dan apa yang menyertainya, orang yang berilmu dan orang yang menuntut ilmu.",
    "arabic": "الدُّنْيَا مَلْعُونَةٌ مَلْعُونٌ مَا فِيهَا إِلَّا ذِكْرَ اللَّهِ وَمَا وَالَاهُ وَعَالِمًا أَوْ مُتَعَلِّمًا",
    "source": "HR. Tirmidzi No. 2322",
    "status": "Hasan",
    "category": "Nilai Ilmu",
    "explanation": "Ilmu dan penuntut ilmu dikecualikan dari laknat dunia."
  },
  {
    "id": 38,
    "text": "Barangsiapa mati dalam keadaan menuntut ilmu untuk menghidupkan Islam, maka antara dia dengan para nabi di surga hanya satu derajat.",
    "arabic": "مَنْ مَاتَ وَهُوَ يَطْلُبُ الْعِلْمَ لِيُحْيِيَ بِهِ الْإِسْلَامَ فَبَيْنَهُ وَبَيْنَ النَّبِيِّينَ دَرَجَةٌ وَاحِدَةٌ فِي الْجَنَّةِ",
    "source": "HR. Darimi No. 354",
    "status": "Hasan",
    "category": "Derajat Penuntut Ilmu",
    "explanation": "Penuntut ilmu yang ikhlas memiliki kedudukan dekat dengan para nabi."
  },
  {
    "id": 39,
    "text": "Apabila manusia telah mati, maka terputuslah amalannya kecuali tiga hal: sedekah jariyah, ilmu yang bermanfaat, atau anak shalih yang mendoakannya.",
    "arabic": "إِذَا مَاتَ الْإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلَّا مِنْ ثَلَاثَةٍ: إِلَّا مِنْ صَدَقَةٍ جَارِيَةٍ، أَوْ عِلْمٍ يُنْتَفَعُ بِهِ، أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ",
    "source": "HR. Muslim No. 1631",
    "status": "Shahih",
    "category": "Amal Jariyah",
    "explanation": "Ilmu yang bermanfaat adalah amal yang pahalanya terus mengalir setelah kematian."
  },
  {
    "id": 40,
    "text": "Barangsiapa mengajarkan satu ayat dari Kitab Allah, maka baginya pahalanya selama ayat itu dibaca.",
    "arabic": "مَنْ عَلَّمَ آيَةً مِنْ كِتَابِ اللَّهِ كَانَ لَهُ ثَوَابُهَا مَا تُلِيَتْ",
    "source": "HR. Suyuthi dalam Al-Jami' As-Shaghir",
    "status": "Hasan",
    "category": "Pahala Mengajar Al-Qur'an",
    "explanation": "Mengajarkan Al-Qur'an memberikan pahala yang berkelanjutan."
  },
  {
    "id": 41,
    "text": "Tolonglah saudaramu baik dalam keadaan dzalim atau terdzalimi. Mereka bertanya: Ya Rasulullah, kami menolong orang yang terdzalimi, bagaimana menolong orang yang dzalim? Beliau menjawab: Dengan mencegahnya dari kedzaliman.",
    "arabic": "انْصُرْ أَخَاكَ ظَالِمًا أَوْ مَظْلُومًا. قَالُوا: يَا رَسُولَ اللَّهِ، هَذَا نَنْصُرُهُ مَظْلُومًا، فَكَيْفَ نَنْصُرُهُ ظَالِمًا؟ قَالَ: تَحْجُزُهُ أَوْ تَمْنَعُهُ مِنَ الظُّلْمِ",
    "source": "HR. Bukhari No. 6952",
    "status": "Shahih",
    "category": "Mendidik dengan Bijaksana",
    "explanation": "Mendidik orang yang salah adalah bentuk pertolongan."
  },
  {
    "id": 42,
    "text": "Mukmin yang bergaul dengan manusia dan bersabar atas gangguan mereka lebih baik daripada mukmin yang tidak bergaul dengan manusia dan tidak bersabar atas gangguan mereka.",
    "arabic": "الْمُؤْمِنُ الَّذِي يُخَالِطُ النَّاسَ وَيَصْبِرُ عَلَى أَذَاهُمْ خَيْرٌ مِنَ الْمُؤْمِنِ الَّذِي لَا يُخَالِطُ النَّاسَ وَلَا يَصْبِرُ عَلَى أَذَاهُمْ",
    "source": "HR. Tirmidzi No. 2507",
    "status": "Shahih",
    "category": "Interaksi Sosial",
    "explanation": "Bergaul untuk mendidik masyarakat lebih utama meski ada kesulitan."
  },
  {
    "id": 43,
    "text": "Sesungguhnya Allah telah mewajibkan kewajiban-kewajiban, maka janganlah kalian sia-siakan. Dan Dia telah menetapkan batasan-batasan, maka janganlah kalian langgar.",
    "arabic": "إِنَّ اللَّهَ فَرَضَ فَرَائِضَ فَلَا تُضَيِّعُوهَا، وَحَدَّ حُدُودًا فَلَا تَعْتَدُوهَا",
    "source": "HR. Daraquthni",
    "status": "Hasan",
    "category": "Batasan Ilmu",
    "explanation": "Ilmu harus digunakan dalam koridor yang benar."
  },
  {
    "id": 44,
    "text": "Siapa yang mempelajari ilmu pengetahuan yang seharusnya untuk mencari wajah Allah, tetapi tidak mempelajarinya melainkan untuk mendapat bagian dari dunia, maka ia tidak akan mendapat bau surga pada hari kiamat.",
    "arabic": "مَنْ طَلَبَ الْعِلْمَ لِيُجَارِيَ بِهِ الْعُلَمَاءَ أَوْ لِيُمَارِيَ بِهِ السُّفَهَاءَ أَوْ يَصْرِفَ بِهِ وُجُوهَ النَّاسِ إِلَيْهِ أَدْخَلَهُ اللَّهُ النَّارَ",
    "source": "HR. Tirmidzi No. 2654",
    "status": "Shahih",
    "category": "Niat Menuntut Ilmu",
    "explanation": "Ilmu untuk riya' dan kesombongan akan menjerumuskan ke neraka."
  },
  {
    "id": 45,
    "text": "Barangsiapa bertambah ilmunya tetapi tidak bertambah hidayahnya, maka tidak bertambah dari Allah kecuali jauhnya.",
    "arabic": "مَنِ ازْدَادَ عِلْمًا وَلَمْ يَزْدَدْ هُدًى لَمْ يَزْدَدْ مِنَ اللَّهِ إِلَّا بُعْدًا",
    "source": "HR. Thabrani",
    "status": "Hasan",
    "category": "Ilmu dan Hidayah",
    "explanation": "Ilmu harus diiringi dengan hidayah dan ketakwaan."
  },
  {
    "id": 46,
    "text": "Berdoalah: Ya Allah, aku berlindung kepada-Mu dari ilmu yang tidak bermanfaat, dari hati yang tidak khusyuk, dari jiwa yang tidak pernah merasa puas, dan dari doa yang tidak dikabulkan.",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا",
    "source": "HR. Muslim No. 2722",
    "status": "Shahih",
    "category": "Doa Perlindungan",
    "explanation": "Berlindung dari ilmu yang tidak bermanfaat adalah doa Nabi."
  },
  {
    "id": 47,
    "text": "Sampaikanlah dariku walau satu ayat, dan ceritakanlah tentang Bani Israil dan tidak ada dosa. Barangsiapa berdusta atas namaku dengan sengaja, maka hendaklah ia menempati tempatnya di neraka.",
    "arabic": "بَلِّغُوا عَنِّي وَلَوْ آيَةً، وَحَدِّثُوا عَنْ بَنِي إِسْرَائِيلَ وَلَا حَرَجَ، وَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ",
    "source": "HR. Bukhari No. 3461",
    "status": "Shahih",
    "category": "Kewajiban Menyampaikan Ilmu",
    "explanation": "Menyampaikan ilmu walau sedikit adalah kewajiban."
  },
  {
    "id": 48,
    "text": "Allah tidak mengutus seorang nabi pun melainkan dengan bahasa kaumnya agar dia dapat menjelaskan kepada mereka.",
    "arabic": "وَمَا أَرْسَلْنَا مِن رَّسُولٍ إِلَّا بِلِسَانِ قَوْمِهِ لِيُبَيِّنَ لَهُمْ",
    "source": "QS. Ibrahim: 4 (dikutip dalam hadits)",
    "status": "Shahih",
    "category": "Metode Dakwah",
    "explanation": "Mengajar harus dengan bahasa yang dipahami murid."
  },
  {
    "id": 49,
    "text": "Barangsiapa membaca satu huruf dari Kitab Allah, maka baginya satu kebaikan, dan satu kebaikan dilipatgandakan menjadi sepuluh. Aku tidak mengatakan 'Alif Lam Mim' satu huruf, tetapi Alif satu huruf, Lam satu huruf, dan Mim satu huruf.",
    "arabic": "مَنْ قَرَأَ حَرْفًا مِنْ كِتَابِ اللَّهِ فَلَهُ بِهِ حَسَنَةٌ، وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا، لَا أَقُولُ الم حَرْفٌ، وَلَكِنْ أَلِفٌ حَرْفٌ وَلَامٌ حَرْفٌ وَمِيمٌ حَرْفٌ",
    "source": "HR. Tirmidzi No. 2910",
    "status": "Shahih",
    "category": "Keutamaan Membaca Al-Qur'an",
    "explanation": "Setiap huruf Al-Qur'an memiliki pahala yang berlipat ganda."
  },
  {
    "id": 50,
    "text": "Akan datang kepada manusia suatu zaman di mana tidak tersisa dari Islam kecuali namanya, dan tidak tersisa dari Al-Qur'an kecuali tulisannya. Masjid-masjid mereka ramai tetapi kosong dari hidayah. Ulama mereka adalah seburuk-buruk makhluk di bawah langit.",
    "arabic": "يَأْتِي عَلَى النَّاسِ زَمَانٌ لَا يَبْقَى مِنَ الْإِسْلَامِ إِلَّا اسْمُهُ، وَلَا يَبْقَى مِنَ الْقُرْآنِ إِلَّا رَسْمُهُ، مَسَاجِدُهُمْ عَامِرَةٌ وَهِيَ خَرَابٌ مِنَ الْهُدَى، عُلَمَاؤُهُمْ شَرُّ مَنْ تَحْتَ أَدِيمِ السَّمَاءِ",
    "source": "HR. Baihaqi dalam Syu'ab al-Iman",
    "status": "Hasan",
    "category": "Peringatan",
    "explanation": "Peringatan tentang bahaya ilmu tanpa amal dan hidayah."
  }
]
